blogger/app/models/tag.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "hi"], ["created_at", "2020-08-26 19:15:49.201539"], ["updated_at", "2020-08-26 19:15:49.201539"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "hi"], ["LIMIT", 1]]
---
  def tag_list=(tags_string)
    tag_names = tags_string.split(',').collect { |s| s.strip.downcase }.uniq
    new_or_found_tags = tag_names.collect { |name| Tag.find_or_create_by(name: name) }