app/controllers/authors_controller.rb

INSERT INTO "authors" ("username", "email", "crypted_password", "salt", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

UPDATE "authors" SET "salt" = $1, "crypted_password" = $2, "updated_at" = $3 WHERE "authors"."id" = $4  [["salt", "fxwmaEdmx_gnEPajei7m"], ["crypted_password", "$2a$10$f013LsDqEUy6mhmhR7a2/O37HdspYsK7eHjMwE.LsdGbAdOFP4ZZC"], ["updated_at", "2020-08-27 10:52:35.349799"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)

SELECT COUNT(*) FROM "authors"
---
  def zero_authors_or_authenticated
    unless Author.count == 0 || current_user