blogger/app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("username", "email", "crypted_password", "salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def zero_authors_or_authenticated
    unless Author.count == 0 || current_user
---
SELECT COUNT(*) FROM "authors"