blogger/app/controllers/tags_controller.rb

  def create
    @tag = Tag.new(tag_params)
    @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "hmm"], ["created_at", "2020-08-26 19:29:14.859091"], ["updated_at", "2020-08-26 19:29:14.859091"]]